<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/589df9cc-9ec4-4716-a9ce-544c063cef19/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_prometheus_workspace.prometheus will be updated in-place
  ~ resource "aws_prometheus_workspace" "prometheus" {
        id                  = "ws-86adde76-f99a-4773-847b-00e9b4384c0a"
      ~ tags                = {
          - "application" = "history" -> null
        }
      ~ tags_all            = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place
  ~ resource "aws_acm_certificate" "domain_certificate" {
        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/44749651-e494-45f7-85e2-2a3d28035b8c"
      ~ tags                      = {
          - "application" = "history" -> null
        }
      ~ tags_all                  = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_cloudwatch_log_group.cluster_logs will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "cluster_logs" {
        id                = "walletconnect-staging-history_logs"
        name              = "walletconnect-staging-history_logs"
      ~ tags              = {
          - "application" = "history" -> null
        }
      ~ tags_all          = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_cluster.app_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "app_cluster" {
        id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/walletconnect-staging-history"
        name               = "walletconnect-staging-history"
      ~ tags               = {
          - "application" = "history" -> null
        }
      ~ tags_all           = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/walletconnect-staging-history/walletconnect-staging-history-service"
        name                               = "walletconnect-staging-history-service"
      ~ tags                               = {
          - "application" = "history" -> null
        }
      ~ tags_all                           = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition will be updated in-place
  ~ resource "aws_ecs_task_definition" "app_task_definition" {
        id                       = "walletconnect-staging-history"
      ~ tags                     = {
          - "application" = "history" -> null
        }
      ~ tags_all                 = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_policy.otel will be updated in-place
  ~ resource "aws_iam_policy" "otel" {
        id        = "arn:aws:iam::898587786287:policy/walletconnect-staging-history-otel"
        name      = "walletconnect-staging-history-otel"
      ~ tags      = {
          - "application" = "history" -> null
        }
      ~ tags_all  = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "walletconnect-staging-history-ecs-task-execution-role"
        name                  = "walletconnect-staging-history-ecs-task-execution-role"
      ~ tags                  = {
          - "application" = "history" -> null
        }
      ~ tags_all              = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.ecs.aws_lb.application_load_balancer will be updated in-place
  ~ resource "aws_lb" "application_load_balancer" {
        id                                          = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/walletconnect-staging-history/60b171566a3acf0a"
        name                                        = "walletconnect-staging-history"
      ~ tags                                        = {
          - "application" = "history" -> null
        }
      ~ tags_all                                    = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_lb_listener.listener will be updated in-place
  ~ resource "aws_lb_listener" "listener" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/walletconnect-staging-history/60b171566a3acf0a/6d09b07767617a8d"
      ~ tags              = {
          - "application" = "history" -> null
        }
      ~ tags_all          = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_listener.listener-http will be updated in-place
  ~ resource "aws_lb_listener" "listener-http" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/walletconnect-staging-history/60b171566a3acf0a/51a5940ccb2b0d6d"
      ~ tags              = {
          - "application" = "history" -> null
        }
      ~ tags_all          = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_target_group.target_group will be updated in-place
  ~ resource "aws_lb_target_group" "target_group" {
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/walletconnect-staging-history/eadfa45347d00c71"
        name                               = "walletconnect-staging-history"
      ~ tags                               = {
          - "application" = "history" -> null
        }
      ~ tags_all                           = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs.aws_security_group.app_ingress will be updated in-place
  ~ resource "aws_security_group" "app_ingress" {
        id                     = "sg-07d2c39636cd7d550"
        name                   = "walletconnect-staging-history-ingress-to-app"
      ~ tags                   = {
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_ingress will be updated in-place
  ~ resource "aws_security_group" "lb_ingress" {
        id                     = "sg-0ff0dd35001fd3826"
        name                   = "walletconnect-staging-history-lb-ingress"
      ~ tags                   = {
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.history_docdb.aws_docdb_cluster.docdb_primary will be updated in-place
  ~ resource "aws_docdb_cluster" "docdb_primary" {
        id                              = "walletconnect-staging-history-history-db-primary"
      ~ tags                            = {
          - "application" = "history" -> null
        }
      ~ tags_all                        = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (24 unchanged attributes hidden)
    }

  # module.history_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be updated in-place
  ~ resource "aws_docdb_cluster_instance" "docdb_instances" {
        id                           = "walletconnect-staging-history-history-db-primary-instance-0"
      ~ tags                         = {
          - "application" = "history" -> null
        }
      ~ tags_all                     = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)
    }

  # module.history_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place
  ~ resource "aws_docdb_subnet_group" "private_subnets" {
        id          = "walletconnect-staging-history-history-db-private-subnet-group"
        name        = "walletconnect-staging-history-history-db-private-subnet-group"
      ~ tags        = {
          - "application" = "history" -> null
        }
      ~ tags_all    = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.history_docdb.aws_kms_key.docdb_encryption will be updated in-place
  ~ resource "aws_kms_key" "docdb_encryption" {
        id                                 = "fbd228f2-4579-4aff-b06d-727bafda9266"
      ~ tags                               = {
          - "application" = "history" -> null
        }
      ~ tags_all                           = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.history_docdb.aws_secretsmanager_secret.master_password will be updated in-place
  ~ resource "aws_secretsmanager_secret" "master_password" {
        id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:walletconnect-staging-history-history-db-master-password-xJPdBI"
        name                           = "walletconnect-staging-history-history-db-master-password"
      ~ tags                           = {
          - "application" = "history" -> null
        }
      ~ tags_all                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.history_docdb.aws_security_group.service_security_group will be updated in-place
  ~ resource "aws_security_group" "service_security_group" {
        id                     = "sg-061696a56aedc4008"
        name                   = "walletconnect-staging-history-history-db-service"
      ~ tags                   = {
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.monitoring.data.jsonnet_file.dashboard will be read during apply
  # (config refers to values not yet known)
 <= data "jsonnet_file" "dashboard" {
      + ext_str  = {
          + "cloudwatch_uid"   = (known after apply)
          + "dashboard_title"  = "staging - history"
          + "dashboard_uid"    = "staging-history"
          + "docdb_cluster_id" = "walletconnect-staging-history-history-db-primary"
          + "ecs_service_name" = "walletconnect-staging-history-service"
          + "environment"      = "staging"
          + "load_balancer"    = "app/walletconnect-staging-history/60b171566a3acf0a"
          + "notifications"    = jsonencode([])
          + "prometheus_uid"   = (known after apply)
          + "target_group"     = "targetgroup/walletconnect-staging-history/eadfa45347d00c71"
        }
      + id       = (known after apply)
      + rendered = (known after apply)
      + source   = "monitoring/dashboard.jsonnet"
    }

  # module.monitoring.grafana_dashboard.main will be created
  + resource "grafana_dashboard" "main" {
      + config_json  = (known after apply)
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + message      = "Updated by Terraform"
      + overwrite    = true
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.monitoring.grafana_data_source.cloudwatch will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "walletconnect-eu-central-1-staging-history-cloudwatch"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.monitoring.grafana_data_source.prometheus will be created
  + resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + httpMethod    = "GET"
              + manageAlerts  = false
              + sigV4Auth     = true
              + sigV4AuthType = "ec2_iam_role"
              + sigV4Region   = "eu-central-1"
            }
        )
      + name               = "walletconnect-eu-central-1-staging-history-amp"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-86adde76-f99a-4773-847b-00e9b4384c0a/"
    }

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-01dde886ec5b1859c"
      ~ tags                   = {
            "Name"        = "staging-history-default"
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0a519aa7a80d7137d"
      ~ tags                   = {
            "Name"        = "staging-history-default"
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-094501bf8977112e2"
        name                   = "default"
      ~ tags                   = {
            "Name"        = "staging-history-default"
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-00d85da85a5ee9b92"
      ~ tags                 = {
            "Name"        = "staging-history-eu-central-1a"
          - "application" = "history" -> null
        }
      ~ tags_all             = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-00bec4bdcd8f0828f"
      ~ tags     = {
            "Name"        = "staging-history"
          - "application" = "history" -> null
        }
      ~ tags_all = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0f22103e67a0f8858"
      ~ tags                 = {
            "Name"        = "staging-history-eu-central-1a"
          - "application" = "history" -> null
        }
      ~ tags_all             = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-095a8e9e1e84e5423"
      ~ tags             = {
            "Name"        = "staging-history-private"
          - "application" = "history" -> null
        }
      ~ tags_all         = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-02ad02a1d7bd626c2"
      ~ tags             = {
            "Name"        = "staging-history-public"
          - "application" = "history" -> null
        }
      ~ tags_all         = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0a54f4fbc62a07f83"
      ~ tags                                           = {
            "Name"        = "staging-history-private-eu-central-1a"
            "Visibility"  = "private"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0be8f48e6b047db7c"
      ~ tags                                           = {
            "Name"        = "staging-history-private-eu-central-1b"
            "Visibility"  = "private"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-06274970559b4ec00"
      ~ tags                                           = {
            "Name"        = "staging-history-private-eu-central-1c"
            "Visibility"  = "private"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-04be3d082ab96a054"
      ~ tags                                           = {
            "Name"        = "staging-history-public-eu-central-1a"
            "Visibility"  = "public"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-09aee6302088ed50c"
      ~ tags                                           = {
            "Name"        = "staging-history-public-eu-central-1b"
            "Visibility"  = "public"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0b63dd9c124ced7c6"
      ~ tags                                           = {
            "Name"        = "staging-history-public-eu-central-1c"
            "Visibility"  = "public"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-004131c2efe4d188f"
      ~ tags                                 = {
            "Name"        = "staging-history"
          - "application" = "history" -> null
        }
      ~ tags_all                             = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 3 to add, 35 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_prometheus_workspace.prometheus will be updated in-place%0A  ~ resource "aws_prometheus_workspace" "prometheus" {%0A        id                  = "ws-86adde76-f99a-4773-847b-00e9b4384c0a"%0A      ~ tags                = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all            = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place%0A  ~ resource "aws_acm_certificate" "domain_certificate" {%0A        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/44749651-e494-45f7-85e2-2a3d28035b8c"%0A      ~ tags                      = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                  = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_cloudwatch_log_group.cluster_logs will be updated in-place%0A  ~ resource "aws_cloudwatch_log_group" "cluster_logs" {%0A        id                = "walletconnect-staging-history_logs"%0A        name              = "walletconnect-staging-history_logs"%0A      ~ tags              = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all          = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_cluster.app_cluster will be updated in-place%0A  ~ resource "aws_ecs_cluster" "app_cluster" {%0A        id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/walletconnect-staging-history"%0A        name               = "walletconnect-staging-history"%0A      ~ tags               = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all           = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (2 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/walletconnect-staging-history/walletconnect-staging-history-service"%0A        name                               = "walletconnect-staging-history-service"%0A      ~ tags                               = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                           = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition will be updated in-place%0A  ~ resource "aws_ecs_task_definition" "app_task_definition" {%0A        id                       = "walletconnect-staging-history"%0A      ~ tags                     = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                 = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (12 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_iam_policy.otel will be updated in-place%0A  ~ resource "aws_iam_policy" "otel" {%0A        id        = "arn:aws:iam::898587786287:policy/walletconnect-staging-history-otel"%0A        name      = "walletconnect-staging-history-otel"%0A      ~ tags      = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all  = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place%0A  ~ resource "aws_iam_role" "ecs_task_execution_role" {%0A        id                    = "walletconnect-staging-history-ecs-task-execution-role"%0A        name                  = "walletconnect-staging-history-ecs-task-execution-role"%0A      ~ tags                  = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all              = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_lb.application_load_balancer will be updated in-place%0A  ~ resource "aws_lb" "application_load_balancer" {%0A        id                                          = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/walletconnect-staging-history/60b171566a3acf0a"%0A        name                                        = "walletconnect-staging-history"%0A      ~ tags                                        = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                    = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (21 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_lb_listener.listener will be updated in-place%0A  ~ resource "aws_lb_listener" "listener" {%0A        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/walletconnect-staging-history/60b171566a3acf0a/6d09b07767617a8d"%0A      ~ tags              = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all          = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_lb_listener.listener-http will be updated in-place%0A  ~ resource "aws_lb_listener" "listener-http" {%0A        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/walletconnect-staging-history/60b171566a3acf0a/51a5940ccb2b0d6d"%0A      ~ tags              = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all          = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (4 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group will be updated in-place%0A  ~ resource "aws_lb_target_group" "target_group" {%0A        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/walletconnect-staging-history/eadfa45347d00c71"%0A        name                               = "walletconnect-staging-history"%0A      ~ tags                               = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                           = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_security_group.app_ingress will be updated in-place%0A  ~ resource "aws_security_group" "app_ingress" {%0A        id                     = "sg-07d2c39636cd7d550"%0A        name                   = "walletconnect-staging-history-ingress-to-app"%0A      ~ tags                   = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_security_group.lb_ingress will be updated in-place%0A  ~ resource "aws_security_group" "lb_ingress" {%0A        id                     = "sg-0ff0dd35001fd3826"%0A        name                   = "walletconnect-staging-history-lb-ingress"%0A      ~ tags                   = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_docdb_cluster.docdb_primary will be updated in-place%0A  ~ resource "aws_docdb_cluster" "docdb_primary" {%0A        id                              = "walletconnect-staging-history-history-db-primary"%0A      ~ tags                            = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                        = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (24 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be updated in-place%0A  ~ resource "aws_docdb_cluster_instance" "docdb_instances" {%0A        id                           = "walletconnect-staging-history-history-db-primary-instance-0"%0A      ~ tags                         = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                     = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place%0A  ~ resource "aws_docdb_subnet_group" "private_subnets" {%0A        id          = "walletconnect-staging-history-history-db-private-subnet-group"%0A        name        = "walletconnect-staging-history-history-db-private-subnet-group"%0A      ~ tags        = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all    = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_kms_key.docdb_encryption will be updated in-place%0A  ~ resource "aws_kms_key" "docdb_encryption" {%0A        id                                 = "fbd228f2-4579-4aff-b06d-727bafda9266"%0A      ~ tags                               = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                           = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_secretsmanager_secret.master_password will be updated in-place%0A  ~ resource "aws_secretsmanager_secret" "master_password" {%0A        id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:walletconnect-staging-history-history-db-master-password-xJPdBI"%0A        name                           = "walletconnect-staging-history-history-db-master-password"%0A      ~ tags                           = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_security_group.service_security_group will be updated in-place%0A  ~ resource "aws_security_group" "service_security_group" {%0A        id                     = "sg-061696a56aedc4008"%0A        name                   = "walletconnect-staging-history-history-db-service"%0A      ~ tags                   = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.monitoring.data.jsonnet_file.dashboard will be read during apply%0A  # (config refers to values not yet known)%0A <= data "jsonnet_file" "dashboard" {%0A      + ext_str  = {%0A          + "cloudwatch_uid"   = (known after apply)%0A          + "dashboard_title"  = "staging - history"%0A          + "dashboard_uid"    = "staging-history"%0A          + "docdb_cluster_id" = "walletconnect-staging-history-history-db-primary"%0A          + "ecs_service_name" = "walletconnect-staging-history-service"%0A          + "environment"      = "staging"%0A          + "load_balancer"    = "app/walletconnect-staging-history/60b171566a3acf0a"%0A          + "notifications"    = jsonencode([])%0A          + "prometheus_uid"   = (known after apply)%0A          + "target_group"     = "targetgroup/walletconnect-staging-history/eadfa45347d00c71"%0A        }%0A      + id       = (known after apply)%0A      + rendered = (known after apply)%0A      + source   = "monitoring/dashboard.jsonnet"%0A    }%0A%0A  # module.monitoring.grafana_dashboard.main will be created%0A  + resource "grafana_dashboard" "main" {%0A      + config_json  = (known after apply)%0A      + dashboard_id = (known after apply)%0A      + id           = (known after apply)%0A      + message      = "Updated by Terraform"%0A      + overwrite    = true%0A      + slug         = (known after apply)%0A      + uid          = (known after apply)%0A      + url          = (known after apply)%0A      + version      = (known after apply)%0A    }%0A%0A  # module.monitoring.grafana_data_source.cloudwatch will be created%0A  + resource "grafana_data_source" "cloudwatch" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + defaultRegion = "eu-central-1"%0A            }%0A        )%0A      + name               = "walletconnect-eu-central-1-staging-history-cloudwatch"%0A      + type               = "cloudwatch"%0A      + uid                = (known after apply)%0A    }%0A%0A  # module.monitoring.grafana_data_source.prometheus will be created%0A  + resource "grafana_data_source" "prometheus" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + httpMethod    = "GET"%0A              + manageAlerts  = false%0A              + sigV4Auth     = true%0A              + sigV4AuthType = "ec2_iam_role"%0A              + sigV4Region   = "eu-central-1"%0A            }%0A        )%0A      + name               = "walletconnect-eu-central-1-staging-history-amp"%0A      + type               = "prometheus"%0A      + uid                = (known after apply)%0A      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-86adde76-f99a-4773-847b-00e9b4384c0a/"%0A    }%0A%0A  # module.vpc.aws_default_network_acl.this[0] will be updated in-place%0A  ~ resource "aws_default_network_acl" "this" {%0A        id                     = "acl-01dde886ec5b1859c"%0A      ~ tags                   = {%0A            "Name"        = "staging-history-default"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.vpc.aws_default_route_table.default[0] will be updated in-place%0A  ~ resource "aws_default_route_table" "default" {%0A        id                     = "rtb-0a519aa7a80d7137d"%0A      ~ tags                   = {%0A            "Name"        = "staging-history-default"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.vpc.aws_default_security_group.this[0] will be updated in-place%0A  ~ resource "aws_default_security_group" "this" {%0A        id                     = "sg-094501bf8977112e2"%0A        name                   = "default"%0A      ~ tags                   = {%0A            "Name"        = "staging-history-default"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_eip.nat[0] will be updated in-place%0A  ~ resource "aws_eip" "nat" {%0A        id                   = "eipalloc-00d85da85a5ee9b92"%0A      ~ tags                 = {%0A            "Name"        = "staging-history-eu-central-1a"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all             = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_internet_gateway.this[0] will be updated in-place%0A  ~ resource "aws_internet_gateway" "this" {%0A        id       = "igw-00bec4bdcd8f0828f"%0A      ~ tags     = {%0A            "Name"        = "staging-history"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[0] will be updated in-place%0A  ~ resource "aws_nat_gateway" "this" {%0A        id                   = "nat-0f22103e67a0f8858"%0A      ~ tags                 = {%0A            "Name"        = "staging-history-eu-central-1a"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all             = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] will be updated in-place%0A  ~ resource "aws_route_table" "private" {%0A        id               = "rtb-095a8e9e1e84e5423"%0A      ~ tags             = {%0A            "Name"        = "staging-history-private"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all         = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] will be updated in-place%0A  ~ resource "aws_route_table" "public" {%0A        id               = "rtb-02ad02a1d7bd626c2"%0A      ~ tags             = {%0A            "Name"        = "staging-history-public"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all         = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be updated in-place%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0a54f4fbc62a07f83"%0A      ~ tags                                           = {%0A            "Name"        = "staging-history-private-eu-central-1a"%0A            "Visibility"  = "private"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be updated in-place%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0be8f48e6b047db7c"%0A      ~ tags                                           = {%0A            "Name"        = "staging-history-private-eu-central-1b"%0A            "Visibility"  = "private"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[2] will be updated in-place%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-06274970559b4ec00"%0A      ~ tags                                           = {%0A            "Name"        = "staging-history-private-eu-central-1c"%0A            "Visibility"  = "private"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] will be updated in-place%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-04be3d082ab96a054"%0A      ~ tags                                           = {%0A            "Name"        = "staging-history-public-eu-central-1a"%0A            "Visibility"  = "public"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] will be updated in-place%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-09aee6302088ed50c"%0A      ~ tags                                           = {%0A            "Name"        = "staging-history-public-eu-central-1b"%0A            "Visibility"  = "public"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[2] will be updated in-place%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-0b63dd9c124ced7c6"%0A      ~ tags                                           = {%0A            "Name"        = "staging-history-public-eu-central-1c"%0A            "Visibility"  = "public"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_vpc.this[0] will be updated in-place%0A  ~ resource "aws_vpc" "this" {%0A        id                                   = "vpc-004131c2efe4d188f"%0A      ~ tags                                 = {%0A            "Name"        = "staging-history"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                             = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (16 unchanged attributes hidden)%0A    }%0A%0APlan: 3 to add, 35 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*